gertvb/LPC55S69_GuiGuider/LPC55S69_LVGL_GUI_GUIDER/source/LPC55S69_LVGL_GUI_GUIDER.c
 *        2. I am NOT yet an expert on the LPC55S69 - Thus my setup of is definitely NOT optimal, and there are lots of scope for   *
 *           improvement                                                                                                            *
 *                                                                                                                                  *
 * Subversion : Checking the whole project into SVN has an implication of size, thus I only check in the important files and let    *
 *              MCUXpresso generate the rest                                                                                        *
 *                                                                                                                                  *
 *              So to regenerate the project from the stuff stored in SVN:                                                          *
 *              1. Generate a new MCUXpresso project called LPC55S69_GUI_GUIDER, and add the following : CTimer, ADC, DMA, GPIO,    *
 *                 RTC, USB, DMA SPI, ILI9341 and Debug Console.                                                                    *
 *                 The generated stuff should now sit in S:\workspace\mcuxpresso\LPC55S69_GUI_GUIDER                                *
 *              2. In MCUXpresso open the ConfigTools' Pins, Clocks and Peripherals make minor changes, and update code so that the *
 *                 .mex file can be created and source files added to the project                                                   *
 *              3. Close MCUXpresso                                                                                                 *
 *              4. Copy from S:\local_checked_out_source\c\LPC55S69_GUI_GUIDER the following files :                                *
 *                 .cproject                                                                                                        *
 *                 LPC55S69_GUI_GUIDER.mex                                                                                          *
 *                 /source/LPC55S69_GUI_GUIDER.c                                                                                    *
 *              5. Open MCUXpresso again, and open this project again                                                               *
 *              6. Go into the configtools, Top Menu -> ConfigTools -> Peripherals/Pins/Clocks and change something insignificant   *
 *                 in each like changing the order of the pins at the bottom of the pins config, then:                              *
 *                 Top Menu -> Configtools -> Update Code!!!                                                                        *
 *              7. Back in the editor, do a clean, and then a build                                                                 *
 *              8. Go back to configtools and undo your simple changes and Update Code again, clean and build and the project       *
 *                 should run on your board                                                                                         *
 *                                                                                                                                  *
 * SVN Commit nr 1500! on 2021/06/17 08:38                                                                                          *
 \**********************************************************************************************************************************/

 /**************************************************************************************************************************************************************************\
 * My Subversion Info, automatically updated on commit, don't edit!                                                                                                         *
 *                                                                                                                                                                          *
 $Author:: Gert_v_B                                                                                                                                                         $
 $Date:: 2021-06-17 10:38:06 +0200 (Thu, 17 Jun 2021)                                                                                                                       $
 $Id:: LPC55S69_LVGL_GUI_GUIDER.c 1500 2021-06-17 08:38:06Z Gert_v_B                                                                                                        $
 $Header:: https://techexplorer/svn/SVN_Repository/c/lpc55s69_lvgl_GuiGuider/source/LPC55S69_LVGL_GUI_GUIDER.c 1500 2021-06-17 08:38:06Z Gert_v_B                           $
 $Revision:: 1500                                                                                                                                                           $
 \**************************************************************************************************************************************************************************/

#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "LPC55S69_cm33_core0.h"
#include "fsl_debug_console.h"

/* TODO: insert other include files here. */
#include "littlevgl_support.h" //Modified for EC11 and ILI9341 on the LPC55S69 by GvB, file sits in /board directory. Link lvgl with the functions : lv_port_disp_init & lv_port_indev_init
#include "lvgl.h"
#include "gui_guider.h"
#include "events_init.h"
#include "custom.h"

/* TODO: insert other definitions and declarations here. */
lv_ui guider_ui; //gui_guider.h
lv_ui_chart_series guider_ui_chart_series; //custom.h

static volatile uint16_t Timer_1ms_ticks_counter = 0U;
static volatile bool b_Timer_5ms_Pending_Flag = false;
static volatile bool b_Timer_10ms_Pending_Flag = false;
static volatile bool b_Timer_50ms_Pending_Flag = false;
static volatile bool b_Timer_100ms_Pending_Flag = false;

void CTimer0_1ms_Callback(uint32_t flags)//Check these flags in while(happy) in main.....
{
	Timer_1ms_ticks_counter++;
	lv_tick_inc(1);//Indicate to lvgl that a 1ms tick ocurred, function is fast enough to leave here in the ISR

	if (!b_Timer_5ms_Pending_Flag)//try to speed up the isr a bit, compare is faster than %
	{
		if ((Timer_1ms_ticks_counter % 5) == 0U)
		{
			b_Timer_5ms_Pending_Flag = true;
		}
	}

	if (!b_Timer_10ms_Pending_Flag)
	{
		if ((Timer_1ms_ticks_counter % 10) == 0U)
		{
			b_Timer_10ms_Pending_Flag = true;
		}
	}

	if (!b_Timer_50ms_Pending_Flag)
	{
		if ((Timer_1ms_ticks_counter % 50) == 0U)
		{
			b_Timer_50ms_Pending_Flag = true;
		}
	}

	if (Timer_1ms_ticks_counter >= 100)
	{
		b_Timer_100ms_Pending_Flag = true;
		Timer_1ms_ticks_counter = 0;
	}
}

int main(void)
{
    //Init board hardware.
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    //Init FSL debug console.
    BOARD_InitDebugConsole();
#endif

    PRINTF("LPC55S69 with LvGL and GUI Guider\n");

    lv_init();

    //defined in : /board/littlevgl_support.c & h to link ILI9341 and EC11 to lvgl
    lv_port_disp_init();
    lv_port_indev_init();

    setup_ui(&guider_ui);
    events_init(&guider_ui);//Create a lvgl group and link the EC11 Rotary Encoder to it, encoder driver sits in /board/littlevgl_support.c functions : lv_port_disp_init & lv_port_indev_init
    custom_init(&guider_ui);//Go and populate with your own code

    while(1)
    {
    	if (b_Timer_5ms_Pending_Flag)
    	{
            b_Timer_5ms_Pending_Flag = false;
            lv_task_handler();
    	}
    }
    return 0 ;
}
